#!/usr/bin/env node

console.log(`
                ██████╗  █████╗ ██╗   ██╗ ██████╗  ██████╗ ███╗   ██╗
                ██╔══██╗██╔══██╗╚██╗ ██╔╝██╔═══██╗██╔═══██╗████╗  ██║
                ██║  ██║███████║ ╚████╔╝ ██║   ██║██║   ██║██╔██╗ ██║
                ██║  ██║██╔══██║  ╚██╔╝  ██║   ██║██║   ██║██║╚██╗██║
                ██████╔╝██║  ██║   ██║   ╚██████╔╝╚██████╔╝██║ ╚████║
                ╚═════╝ ╚═╝  ╚═╝   ╚═╝    ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝
                                    (강다윤)


        안녕하십니까. 저는 협업과 문제해결을 중요시하는 강다윤입니다. 간단히 저에 대한 이야기를 하자면 
        저는 고등학교 들어와 자신의 성장과 미래 진로에 대한 고민을 많이 하게 되었습니다. 

        가장 중심이 되는 생각은 사회의 일원으로 다른 사람에게 도움이 되는 일을 하고 싶다는 생각이었습니다. 
        전공 교과들을 배우고 프로그래밍을 하면서 무심코 사용하던 웹 프로그램을 보는 시각이 달라지고 
        오류 없이 안정적이고 쉽고 편하게 사용할 수 있는 시스템을 만드는 일에 관심이 생겼습니다. 

        간단한 애플리케이션을 스스로 만들어보고 팀 활동으로 웹 프로젝트 개발에 참여하여 협업을 통해 
        결과를 도출해 보면서 개발자가 되어 사용자들이 원하는 시스템을 만들고자 하는 마음이 커졌습니다.

        특이사항: 
        1. 주로 Java 언어, 프레임워크는 Spring Boot를 사용하며 최근에는 C/C++, C# 언어에 대해 공부하고 있습니다.
        2. 종류 상관없이 만드는 것을 좋아하며 웹 풀스택 개발을 할 수 있습니다.
        3. SNS 같은 사람과 사람을 이어주는 서비스를 주로 개발하고 있습니다.

        저에 대해 더 알고싶다면?
        Website: https://dayoon07.github.io
        Github: https://github.com/Dayoon07
        Email: gangd0642@gmail.com

`);