#!/usr/bin/env node

console.log(`
                           ██████╗  █████╗ ██╗   ██╗ ██████╗  ██████╗ ███╗   ██╗
                           ██╔══██╗██╔══██╗╚██╗ ██╔╝██╔═══██╗██╔═══██╗████╗  ██║
                           ██║  ██║███████║ ╚████╔╝ ██║   ██║██║   ██║██╔██╗ ██║
                           ██║  ██║██╔══██║  ╚██╔╝  ██║   ██║██║   ██║██║╚██╗██║
                           ██████╔╝██║  ██║   ██║   ╚██████╔╝╚██████╔╝██║ ╚████║
                           ╚═════╝ ╚═╝  ╚═╝   ╚═╝    ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝


        안녕하십니까. 저는 협업과 문제해결을 중요시하는 강다윤입니다. 간단히 저에 대한 이야기를 하자면 
        저는 고등학교 들어와 자신의 성장과 미래 진로에 대한 고민을 많이 하게 되었습니다. 

        가장 중심이 되는 생각은 사회의 일원으로 다른 사람에게 도움이 되는 일을 하고 싶다는 생각이었습니다. 
        전공 교과들을 배우고 프로그래밍을 하면서 무심코 사용하던 프로그램을 보는 시각이 달라지고 
        오류 없이 안정적이고 쉽고 편하게 사용할 수 있는 시스템을 만드는 일에 관심이 생겼습니다. 
        
        저는 만드는 것을 좋아합니다. 사람들이 제가 만든 서비스를 사용할 때마다 다른 사람에게
        도움이 된 것 같아 항상 보람찬 마음을 가집니다. 또한 다른 사람과 팀 프로젝트를 할 때마다
        의사소통을 많이 하며 그 대화 속에서 많은 사람들과 다양한 생각을 공유하며 배우기도 하고
        상대방에게 가르쳐 줄 때도 있었습니다.

        주로 사이드 프로젝트로는 소셜 네트워크 서비스를 개발하는 프로젝트를 진행했고 언어는
        Java, 그리고 웹 표준 언어를 사용해 개발하고 DB 설계와 비즈니스 로직을 개발했습니다.

        이런 다양한 프로젝트 경험과 팀 협업을 통해, 저는 제가 빠르게 저의 진로를 결정할 수 있었고
        많은 사람들에게 도움이 되는 시스템을 개발하는 일을 하고 싶다는 목표를 가지게 되었습니다. 
        앞으로는 그 길을 흔들림 없이 걸어가고 싶습니다.

        특이사항/최근소식: 
        1. 주로 Java 언어, 프레임워크는 Spring Boot를 사용하며 최근에는 C/C++, C# 언어에 대해 공부하고 있습니다.
        2. 종류 상관없이 만드는 것을 좋아하며 웹 풀스택 개발을 할 수 있습니다.
        3. 유튜브, 인스타그램, 페이스북 같은 소셜 네트워크 서비스를 주로 개발하고 있습니다.

        저에 대해 더 알고싶다면 아래 사이트를 방문해보세요.
        Website: https://dayoon07.github.io
        Github: https://github.com/Dayoon07
        Email: gangd0642@gmail.com

`);